<a href="https://colab.research.google.com/github/datajcthemax/playdata/blob/main/day12.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# 12번째 이야기
- 판다스 데이터 프레임 심화 및 활용 사례
- sklearn 데이터셋 받아오기 실습
- 판다스 각 기능을 이해하고 자신의 목적에 맞게 적용하는 실력 갖추기

In [1]:
from sklearn.datasets import load_wine

In [2]:
data = load_wine()
data

{'data': array([[1.423e+01, 1.710e+00, 2.430e+00, ..., 1.040e+00, 3.920e+00,
         1.065e+03],
        [1.320e+01, 1.780e+00, 2.140e+00, ..., 1.050e+00, 3.400e+00,
         1.050e+03],
        [1.316e+01, 2.360e+00, 2.670e+00, ..., 1.030e+00, 3.170e+00,
         1.185e+03],
        ...,
        [1.327e+01, 4.280e+00, 2.260e+00, ..., 5.900e-01, 1.560e+00,
         8.350e+02],
        [1.317e+01, 2.590e+00, 2.370e+00, ..., 6.000e-01, 1.620e+00,
         8.400e+02],
        [1.413e+01, 4.100e+00, 2.740e+00, ..., 6.100e-01, 1.600e+00,
         5.600e+02]]),
 'target': array([0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
        0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
        0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 1, 1, 1, 1, 1, 1,
        1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1,
        1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1,
        1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 2, 2,
        2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2,
        2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2,
        2, 2]),
 'frame': None,
 'target_names': array(['class_0', 'class_1', 'class_2'], dtype='<U7'),
 'DESCR': '.. _wine_dataset:\n\nWine recognition dataset\n------------------------\n\n**Data Set Characteristics:**\n\n    :Number of Instances: 178\n    :Number of Attributes: 13 numeric, predictive attributes and the class\n    :Attribute Information:\n \t\t- Alcohol\n \t\t- Malic acid\n \t\t- Ash\n\t\t- Alcalinity of ash  \n \t\t- Magnesium\n\t\t- Total phenols\n \t\t- Flavanoids\n \t\t- Nonflavanoid phenols\n \t\t- Proanthocyanins\n\t\t- Color intensity\n \t\t- Hue\n \t\t- OD280/OD315 of diluted wines\n \t\t- Proline\n\n    - class:\n            - class_0\n            - class_1\n            - class_2\n\t\t\n    :Summary Statistics:\n    \n    ============================= ==== ===== ======= =====\n                                   Min   Max   Mean     SD\n    ============================= ==== ===== ======= =====\n    Alcohol:                      11.0  14.8    13.0   0.8\n    Malic Acid:                   0.74  5.80    2.34  1.12\n    Ash:                          1.36  3.23    2.36  0.27\n    Alcalinity of Ash:            10.6  30.0    19.5   3.3\n    Magnesium:                    70.0 162.0    99.7  14.3\n    Total Phenols:                0.98  3.88    2.29  0.63\n    Flavanoids:                   0.34  5.08    2.03  1.00\n    Nonflavanoid Phenols:         0.13  0.66    0.36  0.12\n    Proanthocyanins:              0.41  3.58    1.59  0.57\n    Colour Intensity:              1.3  13.0     5.1   2.3\n    Hue:                          0.48  1.71    0.96  0.23\n    OD280/OD315 of diluted wines: 1.27  4.00    2.61  0.71\n    Proline:                       278  1680     746   315\n    ============================= ==== ===== ======= =====\n\n    :Missing Attribute Values: None\n    :Class Distribution: class_0 (59), class_1 (71), class_2 (48)\n    :Creator: R.A. Fisher\n    :Donor: Michael Marshall (MARSHALL%PLU@io.arc.nasa.gov)\n    :Date: July, 1988\n\nThis is a copy of UCI ML Wine recognition datasets.\nhttps://archive.ics.uci.edu/ml/machine-learning-databases/wine/wine.data\n\nThe data is the results of a chemical analysis of wines grown in the same\nregion in Italy by three different cultivators. There are thirteen different\nmeasurements taken for different constituents found in the three types of\nwine.\n\nOriginal Owners: \n\nForina, M. et al, PARVUS - \nAn Extendible Package for Data Exploration, Classification and Correlation. \nInstitute of Pharmaceutical and Food Analysis and Technologies,\nVia Brigata Salerno, 16147 Genoa, Italy.\n\nCitation:\n\nLichman, M. (2013). UCI Machine Learning Repository\n[https://archive.ics.uci.edu/ml]. Irvine, CA: University of California,\nSchool of Information and Computer Science. \n\n.. topic:: References\n\n  (1) S. Aeberhard, D. Coomans and O. de Vel, \n  Comparison of Classifiers in High Dimensional Settings, \n  Tech. Rep. no. 92-02, (1992), Dept. of Computer Science and Dept. of  \n  Mathematics and Statistics, James Cook University of North Queensland. \n  (Also submitted to Technometrics). \n\n  The data was used with many others for comparing various \n  classifiers. The classes are separable, though only RDA \n  has achieved 100% correct classification. \n  (RDA : 100%, QDA 99.4%, LDA 98.9%, 1NN 96.1% (z-transformed data)) \n  (All results using the leave-one-out technique) \n\n  (2) S. Aeberhard, D. Coomans and O. de Vel, \n  "THE CLASSIFICATION PERFORMANCE OF RDA" \n  Tech. Rep. no. 92-01, (1992), Dept. of Computer Science and Dept. of \n  Mathematics and Statistics, James Cook University of North Queensland. \n  (Also submitted to Journal of Chemometrics).\n',
 'feature_names': ['alcohol',
  'malic_acid',
  'ash',
  'alcalinity_of_ash',
  'magnesium',
  'total_phenols',
  'flavanoids',
  'nonflavanoid_phenols',
  'proanthocyanins',
  'color_intensity',
  'hue',
  'od280/od315_of_diluted_wines',
  'proline']}

In [4]:
import pandas as pd
df = pd.DataFrame(data.data, columns=data.feature_names)

In [5]:
# titanic 데이터 train, test 중 
titanic = pd.read_csv('/content/drive/MyDrive/datas/train.csv')

In [6]:
titanic.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [7]:
titanic.shape

(891, 12)

In [8]:
titanic.columns

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

In [9]:
titanic.isnull().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

In [10]:
titanic.shape

(891, 12)

In [11]:
# 결측치가 많은 컬럼 자체를 삭제
titanic.drop('Cabin',axis = 1, inplace=True)
# titanic = titanic.drop('Cabin',axis = 1)

In [12]:
titanic.columns

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Embarked'],
      dtype='object')

In [13]:
# 결측치를 다른 값으로 대체 (age의 중앙값)
age_median = titanic['Age'].median()
age_median

28.0

In [14]:
age_mode = titanic['Age'].mode() # 최빈값
age_mean = titanic['Age'].mean() # 평균값

In [15]:
age_mode, age_mean

(0    24.0
 Name: Age, dtype: float64,
 29.69911764705882)

In [16]:
titanic['Age'].fillna(age_median, inplace=True)

In [17]:
titanic.isna().sum()

PassengerId    0
Survived       0
Pclass         0
Name           0
Sex            0
Age            0
SibSp          0
Parch          0
Ticket         0
Fare           0
Embarked       2
dtype: int64

In [18]:
# Embarked에서 null 레코드는 삭제(행)
titanic.dropna(axis = 0, inplace=True)

In [19]:
titanic.isna().sum()

PassengerId    0
Survived       0
Pclass         0
Name           0
Sex            0
Age            0
SibSp          0
Parch          0
Ticket         0
Fare           0
Embarked       0
dtype: int64

# house 데이터를 가지고
# 결측치가 몇개인지, 어느 컬럼에서 나오는지 확인
# 컬럼을 지워도 보고
# 행을 지워도 보고
# 다른 값으로 대체

In [44]:
house = pd.read_csv('/content/drive/MyDrive/datas/house_price.csv')

In [45]:
house.head()

  지역명               규모구분    연도   월 분양가격(㎡)
0  서울                 전체  2015  10    5841
1  서울         전용면적 60㎡이하  2015  10    5652
2  서울   전용면적 60㎡초과 85㎡이하  2015  10    5882
3  서울  전용면적 85㎡초과 102㎡이하  2015  10    5721
4  서울        전용면적 102㎡초과  2015  10    5879

In [46]:
house.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4505 entries, 0 to 4504
Data columns (total 5 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   지역명      4505 non-null   object
 1   규모구분     4505 non-null   object
 2   연도       4505 non-null   int64
 3   월        4505 non-null   int64
 4   분양가격(㎡)  4210 non-null   object
dtypes: int64(2), object(3)
memory usage: 176.1+ KB

In [47]:
house.isnull().sum()

지역명          0
규모구분         0
연도           0
월            0
분양가격(㎡)    295
dtype: int64

In [48]:
house_col_remove = house.copy()

In [49]:
house_col_remove.drop('분양가격(㎡)', axis=1, inplace=True)

In [50]:
house_col_remove

     지역명               규모구분    연도   월
0     서울                 전체  2015  10
1     서울         전용면적 60㎡이하  2015  10
2     서울   전용면적 60㎡초과 85㎡이하  2015  10
3     서울  전용면적 85㎡초과 102㎡이하  2015  10
4     서울        전용면적 102㎡초과  2015  10
...   ..                ...   ...  ..
4500  제주                 전체  2020   2
4501  제주         전용면적 60㎡이하  2020   2
4502  제주   전용면적 60㎡초과 85㎡이하  2020   2
4503  제주  전용면적 85㎡초과 102㎡이하  2020   2
4504  제주        전용면적 102㎡초과  2020   2

[4505 rows x 4 columns]

In [51]:
house_row_remove = house.copy()

In [52]:
house_row_remove.dropna(axis=0, inplace=True)

In [53]:
house_row_remove.isna().sum()

지역명        0
규모구분       0
연도         0
월          0
분양가격(㎡)    0
dtype: int64

In [54]:
# 분양가격의 평균으로 대체?!
house_rp = house.copy()

In [55]:
house_rp['분양가격(㎡)'] = house_rp['분양가격(㎡)'].mean()

TypeError: ignored

In [56]:
mode = house_rp['분양가격(㎡)'].mode()
# house_rp['분양가격(㎡)'].fillna(10000)

In [57]:
mode.values.item()

'2221'

In [58]:
house_rp['분양가격(㎡)'].fillna(mode.values.item(), inplace=True)
house_rp.isna().sum()

지역명        0
규모구분       0
연도         0
월          0
분양가격(㎡)    0
dtype: int64

In [59]:
# 데이터의 차이
titanic_train = pd.read_csv('/content/drive/MyDrive/datas/train.csv')
titanic_test = pd.read_csv('/content/drive/MyDrive/datas/test.csv')

In [60]:
titanic_train.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [61]:
titanic_test.head()

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
2,894,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q
3,895,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S
4,896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S

# train, test의 컬럼에 차이가 있는데 어떻게 하면 두 데이터를 합칠 수 있을까
# 11시에 같이 공부해볼게요

In [62]:
titanic_test['Age'].mean()

30.272590361445783

In [63]:
titanic_train.drop('Survived', axis=1, inplace=True)

In [64]:
titanic_train.columns

Index(['PassengerId', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp', 'Parch',
       'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

In [65]:
titanic_test.columns

Index(['PassengerId', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp', 'Parch',
       'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

In [66]:
# 두 데이터를 합치기
titanic_train_1 = titanic_train.copy()
titanic_test_1 = titanic_test.copy()

In [67]:
titanic_1 = pd.concat([titanic_train_1,titanic_test_1])
titanic_1.shape

(1309, 11)

In [68]:
df1 = pd.read_csv('/content/drive/MyDrive/datas/korea-star-1.csv')
df2 = pd.read_csv('/content/drive/MyDrive/datas/korea-star-2.csv')

In [69]:
df1.head()

    이름     그룹   소속사  성별        생년월일      키 혈액형     인기지수
0  아이린   레드벨벳    SM  여자  1991-03-29  160.0   A  8256324
1  차은우   아스트로  판타지오  남자  1997-03-30  183.0   B  3506027
2    뷔  방탄소년단   빅히트  남자  1995-12-30  178.0  AB  8073501
3   민현    NaN  플레디스  남자  1995-08-09  182.3   O  4989792
4   소연    아이들    큐브  여자  1998-08-26    NaN   B  4668615

In [70]:
df2.head()

     이름     그룹   소속사  성별        생년월일      키 혈액형     인기지수
0    백호   뉴이스트  플레디스  남자  1995-07-21  175.0  AB  3301654
1    JR   뉴이스트  플레디스  남자  1995-06-08  176.0   O  3274137
2    슈가  방탄소년단   빅히트  남자  1993-03-09  174.0   O  4925442
3  강다니엘    NaN   커넥트  남자  1996-12-10  180.0   A  8273745
4    정국  방탄소년단   빅히트  남자  1997-09-01  178.0   A  7208335

In [71]:
customer_data = {'customer_id':[1,2,3],
                 'name':['Alice', 'Bob', 'Charlie']
                 }
customer_df = pd.DataFrame(customer_data)

In [72]:
customer_df

   customer_id     name
0            1    Alice
1            2      Bob
2            3  Charlie

In [73]:
order_data = {'order_id':[11,12,13],
              'customer_id':[3,1,2],
              'product':['TV','NoteBook','Car']
              }
order_df = pd.DataFrame(order_data)
order_df

   order_id  customer_id   product
0        11            3        TV
1        12            1  NoteBook
2        13            2       Car

In [74]:
merged_df = pd.merge(customer_df, order_df, on='customer_id')
merged_df

   customer_id     name  order_id   product
0            1    Alice        12  NoteBook
1            2      Bob        13       Car
2            3  Charlie        11        TV

In [75]:
df2['소속사'].unique()

array(['플레디스', '빅히트', '커넥트', 'RBW', '스타크루이엔티', 'SM'], dtype=object)

In [76]:
company_data = {'name':['플레디스', '빅히트', '커넥트', 'RBW', '스타크루이엔티', 'SM'],
                'address': ['서울','대전','대구','부산','제주', '독도' ]
                }

In [77]:
company_data = {'name':['플레디스', '빅히트', '커넥트', 'RBW', '스타크루이엔티', 'SM'],
                'address': ['서울','대전','대구','부산','제주', '독도' ]
                }
company_df = pd.DataFrame(company_data)
company_df.columns = ['소속사','주소']

# korea star 1, 2 데이터를 합치고, company df와 결합하기

In [78]:
df1 = df1.copy()
df2 = df2.copy()

In [79]:
df3 = pd.concat([df1,df2])

In [80]:
df3

     이름     그룹      소속사  성별        생년월일      키 혈액형      인기지수
0   아이린   레드벨벳       SM  여자  1991-03-29  160.0   A   8256324
1   차은우   아스트로     판타지오  남자  1997-03-30  183.0   B   3506027
2     뷔  방탄소년단      빅히트  남자  1995-12-30  178.0  AB   8073501
3    민현    NaN     플레디스  남자  1995-08-09  182.3   O   4989792
4    소연    아이들       큐브  여자  1998-08-26    NaN   B   4668615
5     진  방탄소년단      빅히트  남자  1992-12-04  179.2   O   4570308
6    윤아   소녀시대       SM  여자  1989-03-09    NaN   A   3918661
0    백호   뉴이스트     플레디스  남자  1995-07-21  175.0  AB   3301654
1    JR   뉴이스트     플레디스  남자  1995-06-08  176.0   O   3274137
2    슈가  방탄소년단      빅히트  남자  1993-03-09  174.0   O   4925442
3  강다니엘    NaN      커넥트  남자  1996-12-10  180.0   A   8273745
4    정국  방탄소년단      빅히트  남자  1997-09-01  178.0   A   7208335
5    화사    마마무      RBW  여자  1995-07-23  162.1   A   7650928
6   하성운     핫샷  스타크루이엔티  남자  1994-03-22  167.1   A   4036489
7    슬기   레드벨벳       SM  여자  1994-02-10  161.0   A   5021452
8    지민  방탄소년단      빅히트  남자  1995-10-13  173.6   A  10523260

In [81]:
df4 = pd.concat([df3,company_df])

In [82]:
df4

     이름     그룹      소속사   성별        생년월일      키  혈액형        인기지수   주소
0   아이린   레드벨벳       SM   여자  1991-03-29  160.0    A   8256324.0  NaN
1   차은우   아스트로     판타지오   남자  1997-03-30  183.0    B   3506027.0  NaN
2     뷔  방탄소년단      빅히트   남자  1995-12-30  178.0   AB   8073501.0  NaN
3    민현    NaN     플레디스   남자  1995-08-09  182.3    O   4989792.0  NaN
4    소연    아이들       큐브   여자  1998-08-26    NaN    B   4668615.0  NaN
5     진  방탄소년단      빅히트   남자  1992-12-04  179.2    O   4570308.0  NaN
6    윤아   소녀시대       SM   여자  1989-03-09    NaN    A   3918661.0  NaN
0    백호   뉴이스트     플레디스   남자  1995-07-21  175.0   AB   3301654.0  NaN
1    JR   뉴이스트     플레디스   남자  1995-06-08  176.0    O   3274137.0  NaN
2    슈가  방탄소년단      빅히트   남자  1993-03-09  174.0    O   4925442.0  NaN
3  강다니엘    NaN      커넥트   남자  1996-12-10  180.0    A   8273745.0  NaN
4    정국  방탄소년단      빅히트   남자  1997-09-01  178.0    A   7208335.0  NaN
5    화사    마마무      RBW   여자  1995-07-23  162.1    A   7650928.0  NaN
6   하성운     핫샷  스타크루이엔티   남자  1994-03-22  167.1    A   4036489.0  NaN
7    슬기   레드벨벳       SM   여자  1994-02-10  161.0    A   5021452.0  NaN
8    지민  방탄소년단      빅히트   남자  1995-10-13  173.6    A  10523260.0  NaN
0   NaN    NaN     플레디스  NaN         NaN    NaN  NaN         NaN   서울
1   NaN    NaN      빅히트  NaN         NaN    NaN  NaN         NaN   대전
2   NaN    NaN      커넥트  NaN         NaN    NaN  NaN         NaN   대구
3   NaN    NaN      RBW  NaN         NaN    NaN  NaN         NaN   부산
4   NaN    NaN  스타크루이엔티  NaN         NaN    NaN  NaN         NaN   제주
5   NaN    NaN       SM  NaN         NaN    NaN  NaN         NaN   독도

In [88]:
star_cc = pd.concat([df1,df2])
star_comapny_df = pd.merge(star_cc,company_df,on='소속사')
star_comapny_df

      이름     그룹      소속사  성별        생년월일      키 혈액형      인기지수  주소
0    아이린   레드벨벳       SM  여자  1991-03-29  160.0   A   8256324  독도
1     윤아   소녀시대       SM  여자  1989-03-09    NaN   A   3918661  독도
2     슬기   레드벨벳       SM  여자  1994-02-10  161.0   A   5021452  독도
3      뷔  방탄소년단      빅히트  남자  1995-12-30  178.0  AB   8073501  대전
4      진  방탄소년단      빅히트  남자  1992-12-04  179.2   O   4570308  대전
5     슈가  방탄소년단      빅히트  남자  1993-03-09  174.0   O   4925442  대전
6     정국  방탄소년단      빅히트  남자  1997-09-01  178.0   A   7208335  대전
7     지민  방탄소년단      빅히트  남자  1995-10-13  173.6   A  10523260  대전
8     민현    NaN     플레디스  남자  1995-08-09  182.3   O   4989792  서울
9     백호   뉴이스트     플레디스  남자  1995-07-21  175.0  AB   3301654  서울
10    JR   뉴이스트     플레디스  남자  1995-06-08  176.0   O   3274137  서울
11  강다니엘    NaN      커넥트  남자  1996-12-10  180.0   A   8273745  대구
12    화사    마마무      RBW  여자  1995-07-23  162.1   A   7650928  부산
13   하성운     핫샷  스타크루이엔티  남자  1994-03-22  167.1   A   4036489  제주

# apply

In [89]:
data = pd.DataFrame({
    'A':[1,2,3],
    'B':[4,5,6],
    'C':[7,8,9]
})

In [90]:
data

   A  B  C
0  1  4  7
1  2  5  8
2  3  6  9

In [91]:
data.apply(lambda x:x.mean())

A    2.0
B    5.0
C    8.0
dtype: float64

In [92]:
data.apply(lambda x:x.mean(), axis=0)

A    2.0
B    5.0
C    8.0
dtype: float64

In [93]:
data.apply(lambda x:x.mean(), axis=1)

0    4.0
1    5.0
2    6.0
dtype: float64

In [94]:
data

   A  B  C
0  1  4  7
1  2  5  8
2  3  6  9

In [95]:
data['AVG'] = data.apply(lambda x:x.mean(), axis=1)

In [96]:
data

   A  B  C  AVG
0  1  4  7  4.0
1  2  5  8  5.0
2  3  6  9  6.0

In [97]:
def tmp_fn(x):
  return str(x)

In [98]:
data['tmp'] = data.apply(tmp_fn, axis=1)

In [99]:
data

   A  B  C  AVG                                                tmp
0  1  4  7  4.0  A      1.0\nB      4.0\nC      7.0\nAVG    4.0...
1  2  5  8  5.0  A      2.0\nB      5.0\nC      8.0\nAVG    5.0...
2  3  6  9  6.0  A      3.0\nB      6.0\nC      9.0\nAVG    6.0...

In [100]:
# 성적 데이터 만들기
grades = pd.DataFrame(
    {
        'name':['a','b','c','d'],
        'score':[70,88,65,91]
    }
)
grades

  name  score
0    a     70
1    b     88
2    c     65
3    d     91

In [101]:
def score_to_grade(score):
  if score>=90:
    return 'A'
  elif score>=80:
    return 'B'
  elif score>=70:
    return 'C'
  else:
    return 'D'

In [102]:
grades['grade'] = grades['score'].apply(score_to_grade)

In [103]:
grades

  name  score grade
0    a     70     C
1    b     88     B
2    c     65     D
3    d     91     A

# 12시부터 어제 다뤘던 house 데이터 처리하는 것 실습
# 12:10까지는 각자 구상
# 12:10 부터 같이 진행